Proyecto_integrador/app/Controllers/Bicicleta.php

    public function mostrar()
    {
        $bicicletaModel = model('BicicletaModel');
        $data['bicicletas'] = $bicicletaModel->findAll();

        $marcaModel = model('MarcaModel');
        $data['marcas'] = $marcaModel->findAll();

        $modeloModel = model('ModeloModel');
        $data['modelos'] = $modeloModel->findAll();

        $componentesModel = model('ComponentesModel');
        $data['componentes'] = $componentesModel->findAll();

        $caracteristicasModel = model('CaracteristicasModel');
        $data['caracteristicas'] = $caracteristicasModel->findAll();
---
SELECT *
FROM `Bicicleta`
WHERE `Bicicleta`.`deleted_at` IS NULL
SELECT *
FROM `Marca`
WHERE `Marca`.`deleted_at` IS NULL
SELECT *
FROM `Modelo`
WHERE `Modelo`.`deleted_at` IS NULL
SELECT *
FROM `Componentes`
WHERE `Componentes`.`deleted_at` IS NULL
SELECT *
FROM `Caracteristicas`
WHERE `Caracteristicas`.`deleted_at` IS NULL

    public function agregar()
    {
        helper(['form', 'url']);

        $marca = model('MarcaModel');
        $modelo = model('ModeloModel');
        $componentes = model('ComponentesModel');
        $caracteristicas = model('CaracteristicasModel');
        $data['marcas'] = $marca->findAll();
        $data['modelos'] = $modelo->findAll();
        $data['componentes'] = $componentes->findAll();
        $data['caracteristicas'] = $caracteristicas->findAll();
---
SELECT *
FROM `Marca`
WHERE `Marca`.`deleted_at` IS NULL
SELECT *
FROM `Modelo`
WHERE `Modelo`.`deleted_at` IS NULL
SELECT *
FROM `Componentes`
WHERE `Componentes`.`deleted_at` IS NULL
SELECT *
FROM `Caracteristicas`
WHERE `Caracteristicas`.`deleted_at` IS NULL

    public function editar($id)
    {

        $modelo = model('ModeloModel');
        $componentes = model('ComponentesModel');
        $caracteristicas = model('CaracteristicasModel');
        $marca = model('MarcaModel');
        $bicicleta = model('BicicletaModel');
        $data['marcas'] = $marca->findAll();
        $data['modelos'] = $modelo->findAll();
        $data['componentes'] = $componentes->findAll();
        $data['caracteristicas'] = $caracteristicas->findAll();
---
SELECT *
FROM `Marca`
WHERE `Marca`.`deleted_at` IS NULL
SELECT *
FROM `Modelo`
WHERE `Modelo`.`deleted_at` IS NULL
SELECT *
FROM `Componentes`
WHERE `Componentes`.`deleted_at` IS NULL
SELECT *
FROM `Caracteristicas`
WHERE `Caracteristicas`.`deleted_at` IS NULL