Proyecto_integrador/app/Controllers/Caracteristicas.php

SELECT *
FROM `Caracteristicas`
WHERE `Caracteristicas`.`deleted_at` IS NULL
---
    public function mostrar()
    {

        $session = session();
        if ($session->get('logged_in') != TRUE) {
            return redirect('/');
        }

        //Se cargan los modelos
        $caracteristicasModel = model('CaracteristicasModel');
        $data['caracteristicas'] = $caracteristicasModel->findAll();