Proyecto_integrador/app/Controllers/Cliente.php

SELECT *
FROM `Bicicleta`
WHERE `Bicicleta`.`deleted_at` IS NULL
SELECT *
FROM `Marca`
WHERE `Marca`.`deleted_at` IS NULL
SELECT *
FROM `Modelo`
WHERE `Modelo`.`deleted_at` IS NULL
SELECT *
FROM `Componentes`
WHERE `Componentes`.`deleted_at` IS NULL
SELECT *
FROM `Caracteristicas`
WHERE `Caracteristicas`.`deleted_at` IS NULL
---
            $campo =
                $valor =

                $data['bicicletas'] = $bicicletaModel->findAll();
            $data['marcas'] = $marcaModel->find();
            $data['modelos'] = $modeloModel->findAll();
            $data['componentes'] = $componentesModel->findAll();
            $data['caracteristicas'] = $caracteristicasModel->findAll();

SELECT *
FROM `Componentes`
WHERE `Componentes`.`deleted_at` IS NULL
---
    else{
        $campo = "";
        $valor = "";
        $data ['componentes']=$componentes->findAll();

SELECT *
FROM `Modelo`
WHERE `Modelo`.`deleted_at` IS NULL
---
    public function buscarModelo(){

        $modeloModel = model('ModeloModel');

        if(isset($_GET['Campo']) && isset($_GET['Valor'])){
        $campo =$_GET['Campo'];
        $valor =$_GET['Valor'];


        if($campo == 'Nombre'){
            $data['modelos']=$modeloModel->like('Nombre',$valor)
            ->findAll();
        }

        if($campo == 'Gama'){
            $data['modelos']=$modeloModel->like('Gama',$valor)
            ->findAll();
        }

        if($campo == 'Año'){
            $data['modelos']=$modeloModel->like('Año',$valor)
            ->findAll();
        }

        if($campo == 'Modalidad'){
            $data['modelos']=$modeloModel->like('Modalidad',$valor)
            ->findAll();
        }

        if($campo == 'Todo'){
            $data ['modelos']=$modeloModel->findAll();