Proyecto_integrador/app/Controllers/Componentes.php

SELECT *
FROM `Componentes`
WHERE `Componentes`.`deleted_at` IS NULL
---
    public function mostrar()
    {
        $componentesModel = model('ComponentesModel');
        $data['componentes'] = $componentesModel->findAll();