Proyecto_integrador/app/Controllers/Distribuidor.php

    public function mostrar()
    {
        $session = session();
        if ($session->get('logged_in') != TRUE) {
            return redirect('/');
        }

        $distribuidorModel = model('DistribuidorModel');
        $data['distribuidores'] = $distribuidorModel->findAll();
---
SELECT *
FROM `Distribuidor`
WHERE `Distribuidor`.`deleted_at` IS NULL