Proyecto_integrador/app/Controllers/Marca.php

SELECT *
FROM `Marca`
WHERE `Marca`.`deleted_at` IS NULL
---
    public function mostrar()
    {
        $marcaModel = model('MarcaModel');
        $data['marcas'] = $marcaModel->findAll();

SELECT *
FROM `Distribuidor`
WHERE `Distribuidor`.`deleted_at` IS NULL
---
    public function editar($id)
    {
        $distribuidores = model('DistribuidorModel');
        $marca = model('MarcaModel');
        $data['marca'] = $marca->find($id);
        $data['distribuidores'] = $distribuidores->findAll();