Proyecto_integrador/app/Controllers/Modelo.php

    public function mostrar(){
        $modeloModel = model('ModeloModel');
        $data['modelos'] = $modeloModel->findAll();
---
SELECT *
FROM `Modelo`
WHERE `Modelo`.`deleted_at` IS NULL