Proyecto_integrador/app/Controllers/Usuario.php

    public function mostrar()
    {
        $usuarioModel = model('UsuarioModel');
        $data['usuarios'] = $usuarioModel->findAll();
---
SELECT *
FROM `Usuarios`
WHERE `Usuarios`.`deleted_at` IS NULL

    public function buscar()
    {
        $usuarioModel = model('UsuarioModel');
        if (isset($_GET['columnaBusqueda']) && isset($_GET['elementoBusqueda'])) {
            $columnaBusqueda = $_GET['columnaBusqueda'];
            $elementoBusqueda = $_GET['elementoBusqueda'];

            if ($columnaBusqueda == 'nombre') {
                $data['usuarios'] = $usuarioModel->like('Nombre', $elementoBusqueda)
                    ->orlike('Apell_Paterno', $elementoBusqueda)
                    ->findAll();
            }

            if ($columnaBusqueda == 'correo') {
                $data['usuarios'] = $usuarioModel->like('correo', $elementoBusqueda)
                    ->findAll();
            }

            if ($columnaBusqueda == 'pais') {
                $data['usuarios'] = $usuarioModel->like('pais', $elementoBusqueda)
                    ->findAll();
            }

            if ($columnaBusqueda == 'todo') {
                $data['usuarios'] = $usuarioModel->findAll();
            }

        } else {
            $columnaBusqueda = "";
            $elementoBusqueda = "";
            $data['usuarios'] = $usuarioModel->findAll();
---
SELECT *
FROM `Usuarios`
WHERE `Usuarios`.`deleted_at` IS NULL